app/views/models/show.html.erb

SELECT "customers".* FROM "customers" INNER JOIN "customers_models" ON "customers"."id" = "customers_models"."customer_id" WHERE "customers_models"."model_id" = $1  [["model_id", 1]]
---

      <%- @model.customers.each do |customer| %>