app/views/terms/index.html.erb

SELECT "terms".* FROM "terms" WHERE "terms"."model_id" = $1  [["model_id", 1]]
---
      <thead>
      <% @model.terms.each do |term| %>

SELECT "responses".* FROM "responses" WHERE "responses"."term_id" = $1  [["term_id", 1]]
---
            <td class="body_term_weight"><%= term.weight %></td>
            <% term.responses.each do |response| %>