app/views/customers/index.html.erb

SELECT "models".* FROM "models" INNER JOIN "customers_models" ON "models"."id" = "customers_models"."model_id" WHERE "customers_models"."customer_id" = $1  [["customer_id", 1]]
---
            <td class="body_model_creator">
              <%- customer.models.each do |model| %>