app/views/customers/show.html.erb

      <tbody>
      <%- @model.terms.each do |term| %>
---
SELECT "terms".* FROM "terms" WHERE "terms"."model_id" = $1  [["model_id", 1]]

              <div class="dropdown">
                <a><%= form_for([@model, @customer, Answer.find_by(term_id: term.id, customer_id: @customer.id, stage: 'draft') || Answer.new]) do |f| %>
                    <%= f.select :response_id, term.responses.collect { |p| [p.response, p.id] }, { include_blank: true }, onChange: "this.form.submit()" %>
---
SELECT  "answers".* FROM "answers" WHERE "answers"."term_id" = $1 AND "answers"."customer_id" = $2 AND "answers"."stage" = $3 LIMIT $4  [["term_id", 1], ["customer_id", 1], ["stage", "draft"], ["LIMIT", 1]]
SELECT "responses".* FROM "responses" WHERE "responses"."term_id" = $1  [["term_id", 1]]