app/controllers/customers_controller.rb

  def set_model
    @model = Model.find(params[:model_id])
---
SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]