app/controllers/models_controller.rb

  def index
    @model = Model.new
    @models = Model.all
---
SELECT "models".* FROM "models"

  def create
    @model = Model.new(model_params)
    @model.user = current_user

    respond_to do |format|
      if @model.save
---
INSERT INTO "models" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["user_id", 1], ["created_at", "2017-08-19 09:27:28.765860"], ["updated_at", "2017-08-19 09:27:28.765860"]]

    def set_model
      @model = Model.find(params[:id])
---
SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]