app/controllers/terms_controller.rb

SELECT "terms".* FROM "terms"
---
  def index
    @terms = Term.all

INSERT INTO "terms" ("name", "weight", "description", "model_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "term"], ["weight", 3], ["description", "description"], ["model_id", 1], ["created_at", "2017-08-21 18:15:02.347947"], ["updated_at", "2017-08-21 18:15:02.347947"]]
---
  def create
    @term = Term.new(term_params)
    @term.model_id = @model.id
    respond_to do |format|
      if @term.save

SELECT  "terms".* FROM "terms" WHERE "terms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_term
    @term = Term.find(params[:id])

SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_model
    @model = Model.find(params[:model_id])